{
  "dimensions": [
    {
      "id": "designForIntegration",
      "name": "Design for Integration",
      "keywords": ["integration", "big idea", "beauty", "function", "process"],
      "Description": "Good design elevates any project, no matter how small, with a thoughtful process that delivers both beauty and function in balance. It is the element that binds all the principles together with a big idea.",
      "Questions": [
        "What is the concept or purpose behind this project, and how will the priorities within the nine other principles inform the unique approach to this project?",
        "How will the project engage the senses and connect people to place?",
        "What makes the project one that people will fight to preserve?",
        "What design strategies can provide multiple benefits across the triple bottom line of social, economic, and environmental value?"
      ]
    },
    {
      "id": "designForWater",
      "name": "Design for Water",
      "keywords": [
        "water",
        "stormwater",
        "rainfall",
        "watershed",
        "efficiency"
      ],
      "Description": "Good design conserves and improves the quality of water as a precious resource.",
      "Questions": [
        "How does the project use water wisely, addressing efficiency and consumption while matching water quality to appropriate use?",
        "How can the project’s water systems maintain function during emergencies or disruptions?",
        "How does the project handle rainfall and stormwater responsibly?",
        "How does the project contribute to a healthy regional watershed?"
      ]
    },
    {
      "id": "designForResources",
      "name": "Design for Resources",
      "keywords": [
        "resources",
        "materials",
        "supply chain",
        "carbon",
        "durability"
      ],
      "Description": "Good design depends on informed material selection, balancing priorities to achieve durable, safe, and healthy projects with an equitable, sustainable supply chain to minimize possible negative impacts to the planet.",
      "Questions": [
        "What factors (priorities) will be considered in making material selection decisions?",
        "How are materials and products selected and designed to reduce embodied carbon and environmental impacts while enhancing building performance?",
        "How can material selection reduce hazards and support equitable labor practices in the supply chain?",
        "How does the project promote zero waste throughout its life cycle?",
        "How does the project celebrate local materials and craft?",
        "How long will the project last, and how does that affect your material?"
      ]
    },
    {
      "id": "designForEconomy",
      "name": "Design for Economy",
      "keywords": ["economy", "value", "cost", "budget", "resources"],
      "Description": "Good design adds value for owners, occupants, community, and planet, regardless of project size and budget.",
      "Questions": [
        "How do we design robust projects that enhance economic, natural, intellectual, and experiential resources?",
        "How will the design choices balance cost with long-term value?",
        "How can the performance of this project be improved in ways that are cost and design neutral?"
      ]
    },
    {
      "id": "designForEnergy",
      "name": "Design for Energy",
      "keywords": [
        "energy",
        "efficiency",
        "net zero",
        "renewable",
        "fossil fuels"
      ],
      "Description": "Good design reduces energy use and eliminates dependence on fossil fuels while improving building performance, function, comfort, and enjoyment.",
      "Questions": [
        "How can passive design strategies contribute to the project’s performance and form?",
        "How can the project exceed building code efficiency standards to approach net zero energy and net zero carbon?",
        "Can the project be powered by clean, renewable energy sources?",
        "How can the project provide for continuous performance improvements over its lifetime?"
      ]
    },
    {
      "id": "designForWellBeing",
      "name": "Design for Well-being",
      "keywords": ["well-being", "health", "comfort", "inclusivity", "nature"],
      "Description": "Good design supports health and well-being for all people, considering physical, mental, and emotional effects on building occupants and the wider surrounding community.",
      "Questions": [
        "How can the design encourage a healthy lifestyle?",
        "How can the project provide greater occupant comfort?",
        "How can the project be welcoming and inclusive for all?",
        "How can the project connect people with place and nature?",
        "How can material selection reduce hazards to occupants and communities throughout the supply chain?"
      ]
    },
    {
      "id": "designForChange",
      "name": "Design for Change",
      "keywords": [
        "change",
        "adaptability",
        "resilience",
        "reuse",
        "future risks"
      ],
      "Description": "Adaptability, resilience, and reuse are essential to good design, which seeks to enhance usability, functionality, and value over time.",
      "Questions": [
        "How does the project address future risks and vulnerabilities from social, economic, and environmental change?",
        "How is the project designed for adaptation to anticipate future uses or changing markets?",
        "How does the project address passive survivability and/or livability?"
      ]
    },
    {
      "id": "designForEquitableCommunities",
      "name": "Design for Equitable Communities",
      "keywords": [
        "equity",
        "community",
        "accessibility",
        "diversity",
        "inclusion"
      ],
      "Description": "Design solutions affect more than the client and current occupants. Good design positively impacts future occupants and the larger community.",
      "Questions": [
        "What is the project’s greater reach?",
        "How could this project contribute to creating a diverse, accessible, walkable, just, human-scaled community?",
        "Who might this project be forgetting?",
        "How can the design process and outcome remove barriers and promote inclusion and social equity, particularly with respect to vulnerable communities?",
        "What opportunities exist in this project to include, engage, and promote human connection?",
        "How can the design support health and resilience for the community during times of need or during emergencies?"
      ]
    },
    {
      "id": "designForEcosystems",
      "name": "Design for Ecosystems",
      "keywords": [
        "ecosystems",
        "habitat",
        "nature",
        "biodiversity",
        "restoration"
      ],
      "Description": "Good design mutually benefits human and nonhuman inhabitants. What we design has a direct impact on the ecosystems in and around the site. Understanding the site dynamics will allow us to be more conscious of our impacts.",
      "Questions": [
        "How can the design support the ecological health of its place over time?",
        "How can the design help users become more aware and connected with the project’s place and regional ecosystem?",
        "How can the project support regional habitat restoration?",
        "How can the project support equitable access to nature?"
      ]
    },
    {
      "id": "designForDiscovery",
      "name": "Design for Discovery",
      "keywords": ["discovery", "learning", "performance", "data", "stories"],
      "Description": "Every project presents a unique opportunity to apply lessons learned from previous projects and gather information to refine the design and construction process.",
      "Questions": [
        "How can the design process foster a long-term relationship between designers, users, and operators to ensure design intentions are realized and the building project performance can improve over time?",
        "How are performance data and experiential stories shared, even if the findings fall short of the vision?",
        "What strategies promote a sense of discovery and delight?"
      ]
    }
  ]
}
